package com.test.roc.core.common;

import lombok.Getter;

/**
 * 错误枚举
 *
 * @author z-Roc
 * @date 2023/12/8
 **/
@Getter
public enum ErrorCode {
    /**
     * 响应码共6位,规则如下：
     * <p>
     * 后五位响应码规范
     * 2-3位：业务模块
     * e.g. 用户管理为：25->A25xxx
     * <p>
     * 4-5位：功能逻辑
     * 00 通用异常(参数,重名,ID缺失,缺失关键参数)
     * 01 添加异常(添加过程中出现的各类异常)
     * 02 删除异常(删除过程中出现的各类异常)
     * 03 修改异常(修改过程中出现的各类异常)
     * 04 数据缺失异常(未找到数据等发现的异常)
     * 05 其他异常
     * 模块
     * 10 用户管理
     * 11 会议管理
     * 12 回收商品管理
     * 13 回收明细管理
     * <p>
     * 末位
     * 具体报错原因
     * 定义范围为0-9
     * 响应码包含的字母全部大写
     */
    MYB_000000("000000", "成功"),
    MYB_111111("111111", "系统错误,请联系管理员"),
    COMMON_000001("000001", "参数不合法!"),

    COMMON_TIME_OUT("990000", "接口超时!"),
    TEST_INTERFACE_TIMEOUT("990001","测试接口响应超时!"),

    /**
     * 会议管理
     * 编号：11
     */
    MEETING_110100("110100", "会议名称重复!"),
    MEETING_110101("110101", "会议创建失败!"),
    MEETING_110201("110201", "会议删除失败!"),
    MEETING_110301("110301", "会议修改失败!"),
    /**
     * 回收商品管理
     * 编号：12
     */
    COMMODITY_120100("120100", "回收商品名称重复!"),
    COMMODITY_120101("120101", "回收商品新增失败!"),
    COMMODITY_120201("120201", "回收商品删除失败!"),
    COMMODITY_120301("120301", "回收商品修改失败!"),
    /**
     * 回收明细
     * 编号：13
     */
    RECOVERY_130100("130100", "回收明细名称重复!"),
    RECOVERY_130101("130101", "回收明细创建失败!"),
    RECOVERY_130201("130201", "回收明细删除失败!"),
    RECOVERY_130301("130301", "回收明细修改失败!"),
    RECOVERY_130302("130302", "客户端查询流水不可修改!"),
    RECOVERY_130501("130404", "回收明细不存在!"),
    /**
     * token异常错误
     */
    MYB_111001("111001", "token为空"),
    MYB_111002("111002", "token过期"),
    MYB_111004("111004", "token验签错误");
    private final String code;
    private final String msg;

    ErrorCode(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }
}